
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 14 to destroy.</code></pre>

* Delete
  * azurerm_application_insights.rota_dtu_app_insights
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;sa-connection-string&#34;]
  * module.sa.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Reader&#34;]
  * module.sa.azurerm_storage_account.storage_account
  * module.sa.azurerm_storage_container.container[&#34;processing&#34;]
  * module.sa.azurerm_storage_container.container[&#34;rota&#34;]
  * module.sa.random_string.storage_account_random_string
* Replace
  * module.kv_hmi.azurerm_key_vault.kv
  * module.kv_hmi.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_hmi.azurerm_key_vault_access_policy.developer[0]
  * module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;4800c310-cd45-4e90-9cf9-857bd0e33759&#34;]
  * module.kv_hmi.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.rota_dtu_app_insights will be destroyed
  # (because azurerm_application_insights.rota_dtu_app_insights is not in configuration)
  - resource "azurerm_application_insights" "rota_dtu_app_insights" {
      - app_id                                = "174b42aa-9d95-47b6-aca1-6a129d720ef3" -> null
      - application_type                      = "java" -> null
      - connection_string                     = (sensitive value)
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Insights/components/hmi-rota-dtu-stg" -> null
      - instrumentation_key                   = (sensitive value)
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "hmi-rota-dtu-stg" -> null
      - resource_group_name                   = "hmi-sharedinfra-stg-rg" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "application"         = "hearings-management-interface"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
        } -> null
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-rota-dtu-connection-string"] will be destroyed
  # (because azurerm_key_vault_secret.secret is not in configuration)
  - resource "azurerm_key_vault_secret" "secret" {
      - content_type            = "" -> null
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
      - id                      = "https://hmi-kv-stg.vault.azure.net/secrets/app-insights-rota-dtu-connection-string/d4d8802c634742dcbd6ea1db51e05657" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> null
      - name                    = "app-insights-rota-dtu-connection-string" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/app-insights-rota-dtu-connection-string/versions/d4d8802c634742dcbd6ea1db51e05657" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/app-insights-rota-dtu-connection-string" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "application"         = "hearings-management-interface"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
          - "source"              = "App Insights"
        } -> null
      - value                   = (sensitive value)
      - version                 = "d4d8802c634742dcbd6ea1db51e05657" -> null
      - versionless_id          = "https://hmi-kv-stg.vault.azure.net/secrets/app-insights-rota-dtu-connection-string" -> null
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["sa-connection-string"] will be destroyed
  # (because azurerm_key_vault_secret.secret is not in configuration)
  - resource "azurerm_key_vault_secret" "secret" {
      - content_type            = "" -> null
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
      - id                      = "https://hmi-kv-stg.vault.azure.net/secrets/sa-connection-string/bbd16532f33b44b185f8c418323c70d2" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> null
      - name                    = "sa-connection-string" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/sa-connection-string/versions/bbd16532f33b44b185f8c418323c70d2" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/sa-connection-string" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "application"         = "hearings-management-interface"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
        } -> null
      - value                   = (sensitive value)
      - version                 = "bbd16532f33b44b185f8c418323c70d2" -> null
      - versionless_id          = "https://hmi-kv-stg.vault.azure.net/secrets/sa-connection-string" -> null
    }

  # module.kv_hmi.azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Recover",
                ]
              - key_permissions         = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                ]
              - object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "4800c310-cd45-4e90-9cf9-857bd0e33759"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "Update",
                  - "ManageContacts",
                  - "ManageIssuers",
                ]
              - key_permissions         = [
                  - "Create",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Update",
                  - "Import",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Sign",
                  - "Verify",
                ]
              - object_id               = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
              - secret_permissions      = [
                  - "Set",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Recover",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      ~ id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> (known after apply)
      ~ name                            = "hmi-kv-stg" -> "hmi-bootstrap-kv-stg" # forces replacement
      ~ tags                            = {
          ~ "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git" -> "https://github.com/HMCTS/hmi-shared-infrastructures-bootstrap.git"
            # (6 unchanged elements hidden)
        }
      ~ vault_uri                       = "https://hmi-kv-stg.vault.azure.net/" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.kv_hmi.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/objectId/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.kv_hmi.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy["4800c310-cd45-4e90-9cf9-857bd0e33759"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/objectId/4800c310-cd45-4e90-9cf9-857bd0e33759" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.kv_hmi.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/objectId/7bde62e7-b39f-487c-95c9-b4c794fdbb96" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      ~ id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg" -> (known after apply)
      + log_analytics_destination_type = (known after apply)
      ~ name                           = "hmi-kv-stg" -> "hmi-bootstrap-kv-stg" # forces replacement
      ~ target_resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - enabled_log {
          - category = "AuditEvent" -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + enabled_log {
          + category       = (known after apply)
          + category_group = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.sa.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Reader"] will be destroyed
  # (because azurerm_role_assignment.storage-account-role-assignment is not in configuration)
  - resource "azurerm_role_assignment" "storage-account-role-assignment" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/providers/Microsoft.Authorization/roleAssignments/e8ba88d8-04b7-4cce-533c-2a0dee17470e" -> null
      - name                 = "e8ba88d8-04b7-4cce-533c-2a0dee17470e" -> null
      - principal_id         = "8e65726d-ee0f-46e7-9105-f97ab9f5e70b" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1" -> null
      - role_definition_name = "Storage Blob Data Reader" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> null
    }

  # module.sa.azurerm_storage_account.storage_account will be destroyed
  # (because azurerm_storage_account.storage_account is not in configuration)
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                       = "Cool" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "RAGRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "hmisastg" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value)
      - primary_blob_connection_string    = (sensitive value)
      - primary_blob_endpoint             = "https://hmisastg.blob.core.windows.net/" -> null
      - primary_blob_host                 = "hmisastg.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value)
      - primary_dfs_endpoint              = "https://hmisastg.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "hmisastg.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://hmisastg.file.core.windows.net/" -> null
      - primary_file_host                 = "hmisastg.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://hmisastg.queue.core.windows.net/" -> null
      - primary_queue_host                = "hmisastg.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://hmisastg.table.core.windows.net/" -> null
      - primary_table_host                = "hmisastg.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://hmisastg.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "hmisastg.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "hmi-sharedinfra-stg-rg" -> null
      - secondary_access_key              = (sensitive value)
      - secondary_blob_connection_string  = (sensitive value)
      - secondary_blob_endpoint           = "https://hmisastg-secondary.blob.core.windows.net/" -> null
      - secondary_blob_host               = "hmisastg-secondary.blob.core.windows.net" -> null
      - secondary_connection_string       = (sensitive value)
      - secondary_dfs_endpoint            = "https://hmisastg-secondary.dfs.core.windows.net/" -> null
      - secondary_dfs_host                = "hmisastg-secondary.dfs.core.windows.net" -> null
      - secondary_location                = "ukwest" -> null
      - secondary_queue_endpoint          = "https://hmisastg-secondary.queue.core.windows.net/" -> null
      - secondary_queue_host              = "hmisastg-secondary.queue.core.windows.net" -> null
      - secondary_table_endpoint          = "https://hmisastg-secondary.table.core.windows.net/" -> null
      - secondary_table_host              = "hmisastg-secondary.table.core.windows.net" -> null
      - secondary_web_endpoint            = "https://hmisastg-secondary.z33.web.core.windows.net/" -> null
      - secondary_web_host                = "hmisastg-secondary.z33.web.core.windows.net" -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "application"         = "hearings-management-interface"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = true -> null

          - container_delete_retention_policy {
              - days = 7 -> null
            }

          - delete_retention_policy {
              - days = 365 -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.sa.azurerm_storage_container.container["processing"] will be destroyed
  # (because azurerm_storage_container.container is not in configuration)
  - resource "azurerm_storage_container" "container" {
      - container_access_type   = "private" -> null
      - has_immutability_policy = false -> null
      - has_legal_hold          = false -> null
      - id                      = "https://hmisastg.blob.core.windows.net/processing" -> null
      - metadata                = {} -> null
      - name                    = "processing" -> null
      - resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/blobServices/default/containers/processing" -> null
      - storage_account_name    = "hmisastg" -> null
    }

  # module.sa.azurerm_storage_container.container["rota"] will be destroyed
  # (because azurerm_storage_container.container is not in configuration)
  - resource "azurerm_storage_container" "container" {
      - container_access_type   = "private" -> null
      - has_immutability_policy = false -> null
      - has_legal_hold          = false -> null
      - id                      = "https://hmisastg.blob.core.windows.net/rota" -> null
      - metadata                = {} -> null
      - name                    = "rota" -> null
      - resource_manager_id     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/blobServices/default/containers/rota" -> null
      - storage_account_name    = "hmisastg" -> null
    }

  # module.sa.random_string.storage_account_random_string will be destroyed
  # (because random_string.storage_account_random_string is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "czwhre9ek4pb1ts49s29t4h8" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "czwhre9ek4pb1ts49s29t4h8" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 6 to add, 0 to change, 14 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1,"Program":"tfcmt","SHA1":"","Vars":{}} -->